# 1.1.2 Латинскую букву А записать 121 раз подряд. 
# Вывести результат.
print("A"*121)