# Даны два целых числа. 
# Выведите значение наименьшего из них.

x = 7
y = 9
if x > y:
    print(y)
else:
    print(x)